#모니터 출력
var = 100
fsval = "Fstring"
print("Hello World")
####################################
#f-접두사
print(f"f접두사:{fsval}, type(fsval)")
####################################
#자료형
ival = var
fval = 1.0
cval = 'A'
sval = "OUTPUT"
bval = True
####################################
#비교 연산자 & 논리 연산자
'''
 = 같다 
 != 같지 않다
 < 작다
 > 크다 
 <= 작거나 같다
 >= 크거나 같다
 
 + 더하기
 - 뺴기
 * 곱하기
 / 나누기
 // 몫 
 ** 거듭제곱
 **(1/2) 제곱근 
 % 나머지
 e 지수 10
 bin(int) 2진수
 oct(int) 8진수
 hex(int) 16진수

 and A와 B 모두 참일때
 or A와 B 중 하나 가 거짓일때
 not A가 참이면 거짓!, 거짓이면 참!

'''
####################################
#리스트,인덱싱,슬라이싱,중첩
list_data1 = [1,2,3]
list_data2 = ['1','2','3']
list_data3 = ["ABC","String"]
list_data4 = list_data1 + list_data3
list_data5 = [1,2,3,['a','b','c']]
print(list_data4)
print("중첩 리스트:"+list_data5[3][0])
####################################
#조건문

####################################
#반복문
####################################
#함수
####################################
